In [1]:
#Progetto FOCS

You have to work on the [University dataset](https://drive.google.com/drive/folders/1Hs3nRtK_F3h8eg59B4-TD1DEua6g8Klv). It contains three different university rankings:
- The Times Higher Education World University Ranking, shortly *Times*,
- the Academic Ranking of World Universities, shortly *Shanghai*,
- the Center for World University Rankings, shortly *cwur*.

Notes
1. It is mandatory to use GitHub for developing the project.
2. The project must be a jupyter notebook.
3. There is no restriction on the libraries that can be used, nor on the Python version.
4. All questions on the project **must** be asked in a public channel on [Zulip](https://focs.zulipchat.com).

In [9]:
import pandas as pd
import re

In [11]:
times = pd.read_csv('timesData.csv')
times.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
0,1,Harvard University,United States of America,99.7,72.4,98.7,98.8,34.5,96.1,"20,152",8.9,25%,NaN,2011
1,2,California Institute of Technology,United States of America,97.7,54.6,98.0,99.9,83.7,96.0,"2,243",6.9,27%,33 : 67,2011
2,3,Massachusetts Institute of Technology,United States of America,97.8,82.3,91.4,99.9,87.5,95.6,"11,074",9.0,33%,37 : 63,2011
3,4,Stanford University,United States of America,98.3,29.5,98.1,99.2,64.3,94.3,"15,596",7.8,22%,42 : 58,2011
4,5,Princeton University,United States of America,90.9,70.3,95.4,99.9,-,94.2,"7,929",8.4,27%,45 : 55,2011

In [10]:
shanghai = pd.read_csv('shanghaiData.csv')
shanghai.head()

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year
0,1,Harvard University,1,100.0,100.0,100.0,100.0,100.0,100.0,72.4,2005
1,2,University of Cambridge,1,73.6,99.8,93.4,53.3,56.6,70.9,66.9,2005
2,3,Stanford University,2,73.4,41.1,72.2,88.5,70.9,72.3,65.0,2005
3,4,"University of California, Berkeley",3,72.8,71.8,76.0,69.4,73.9,72.2,52.7,2005
4,5,Massachusetts Institute of Technology (MIT),4,70.1,74.0,80.6,66.7,65.8,64.3,53.0,2005

In [13]:
cwur = pd.read_csv('cwurData.csv')
cwur.head()

,world_rank,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
0,1,Harvard University,USA,1,7,9,1,1,1,1,NaN,5,100.00,2012
1,2,Massachusetts Institute of Technology,USA,2,9,17,3,12,4,4,NaN,1,91.67,2012
2,3,Stanford University,USA,3,17,11,5,4,2,2,NaN,15,89.50,2012
3,4,University of Cambridge,United Kingdom,1,10,24,4,16,16,11,NaN,50,86.17,2012
4,5,California Institute of Technology,USA,4,2,29,7,37,22,22,NaN,18,85.21,2012

Check of Na values

In [16]:
times.isnull().any()

world_rank                False
university_name           False
country                   False
teaching                  False
international             False
research                  False
citations                 False
income                    False
total_score               False
num_students               True
student_staff_ratio        True
international_students     True
female_male_ratio          True
year                      False
dtype: bool

In [17]:
shanghai.isnull().any()

world_rank         False
university_name     True
national_rank       True
total_score         True
alumni              True
award               True
hici                True
ns                  True
pub                 True
pcp                 True
year               False
dtype: bool

In [18]:
cwur.isnull().any()

world_rank              False
institution             False
country                 False
national_rank           False
quality_of_education    False
alumni_employment       False
quality_of_faculty      False
publications            False
influence               False
citations               False
broad_impact             True
patents                 False
score                   False
year                    False
dtype: bool

## 1. For each university, extract from the times dataset the most recent and the least recent data, obtaining two separate dataframes

In [19]:
times['year'].dtype

dtype('int64')

In [20]:
times[times['university_name'] == 'Harvard University']

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
0,1,Harvard University,United States of America,99.7,72.4,98.7,98.8,34.5,96.1,"20,152",8.9,25%,NaN,2011
201,2,Harvard University,United States of America,95.8,67.5,97.4,99.8,35.9,93.9,"20,152",8.9,25%,NaN,2012
605,4,Harvard University,United States of America,94.9,63.7,98.6,99.2,39.9,93.6,"20,152",8.9,25%,NaN,2013
1003,2,Harvard University,United States of America,95.3,66.2,98.5,99.1,40.6,93.9,"20,152",8.9,25%,NaN,2014
1403,2,Harvard University,United States of America,92.9,67.6,98.6,98.9,44.0,93.3,"20,152",8.9,25%,NaN,2015
1808,6,Harvard University,United States of America,83.6,77.2,99.0,99.8,45.2,91.6,"20,152",8.9,25%,NaN,2016

In [23]:
times_max_year = times.iloc[times.groupby('university_name').idxmax()['year']]
times_max_year.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
2405,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,-,-,"35,569",17.0,1%,-,2016
2003,201-250,Aalborg University,Denmark,25.1,71.0,28.4,73.8,43.7,-,"17,422",15.9,15%,48 : 52,2016
2056,251-300,Aalto University,Finland,31.1,65.4,32.8,62.1,61.6,-,"16,099",24.2,17%,32 : 68,2016
1908,=106,Aarhus University,Denmark,36.9,76.8,50.7,79.8,68.3,57.7,"23,895",13.6,14%,54 : 46,2016
2105,301-350,Aberystwyth University,United Kingdom,21.6,72.2,18.9,67.2,31.3,-,"9,252",19.2,18%,48 : 52,2016

In [24]:
times_min_year = times.iloc[times.groupby('university_name').idxmin()['year']]
times_min_year.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
2405,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,-,-,"35,569",17.0,1%,-,2016
501,301-350,Aalborg University,Denmark,19.0,75.3,20.0,27.1,36.4,-,"17,422",15.9,15%,48 : 52,2012
502,301-350,Aalto University,Finland,26.2,49.0,22.2,37.5,61.9,-,"16,099",24.2,17%,32 : 68,2012
166,167,Aarhus University,Denmark,38.1,33.4,55.6,57.3,61.5,49.9,"23,895",13.6,14%,54 : 46,2011
476,276-300,Aberystwyth University,United Kingdom,19.8,63.8,15.5,56.6,35.5,-,"9,252",19.2,18%,48 : 52,2012

## 2. For each university, compute the improvement in income between the least recent and the most recent data points

In [32]:
merged = pd.merge(times_min_year, times_max_year, on = ['university_name', 'country'], suffixes = ['_min', '_max'])
merged.head()

,world_rank_min,university_name,country,teaching_min,international_min,research_min,citations_min,income_min,total_score_min,num_students_min,...,international_max,research_max,citations_max,income_max,total_score_max,num_students_max,student_staff_ratio_max,international_students_max,female_male_ratio_max,year_max
0,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,-,-,"35,569",...,17.9,3.7,35.7,-,-,"35,569",17.0,1%,-,2016
1,301-350,Aalborg University,Denmark,19.0,75.3,20.0,27.1,36.4,-,"17,422",...,71.0,28.4,73.8,43.7,-,"17,422",15.9,15%,48 : 52,2016
2,301-350,Aalto University,Finland,26.2,49.0,22.2,37.5,61.9,-,"16,099",...,65.4,32.8,62.1,61.6,-,"16,099",24.2,17%,32 : 68,2016
3,167,Aarhus University,Denmark,38.1,33.4,55.6,57.3,61.5,49.9,"23,895",...,76.8,50.7,79.8,68.3,57.7,"23,895",13.6,14%,54 : 46,2016
4,276-300,Aberystwyth University,United Kingdom,19.8,63.8,15.5,56.6,35.5,-,"9,252",...,72.2,18.9,67.2,31.3,-,"9,252",19.2,18%,48 : 52,2016

In [37]:
merged[merged['university_name'] == 'Harvard University']['income_max'].dtype

dtype('O')

In [53]:
def difference(row):
    if (row['income_max'] == '-') or (row['income_min'] == '-'):
        return 'data not available'
    else:
        return float(row['income_max']) - float(row['income_min'])

In [54]:
merged['difference'] = merged.apply(difference, axis = 1)
merged.head()

,world_rank_min,university_name,country,teaching_min,international_min,research_min,citations_min,income_min,total_score_min,num_students_min,...,research_max,citations_max,income_max,total_score_max,num_students_max,student_staff_ratio_max,international_students_max,female_male_ratio_max,year_max,difference
0,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,-,-,"35,569",...,3.7,35.7,-,-,"35,569",17.0,1%,-,2016,data not available
1,301-350,Aalborg University,Denmark,19.0,75.3,20.0,27.1,36.4,-,"17,422",...,28.4,73.8,43.7,-,"17,422",15.9,15%,48 : 52,2016,7.3
2,301-350,Aalto University,Finland,26.2,49.0,22.2,37.5,61.9,-,"16,099",...,32.8,62.1,61.6,-,"16,099",24.2,17%,32 : 68,2016,-0.3
3,167,Aarhus University,Denmark,38.1,33.4,55.6,57.3,61.5,49.9,"23,895",...,50.7,79.8,68.3,57.7,"23,895",13.6,14%,54 : 46,2016,6.8
4,276-300,Aberystwyth University,United Kingdom,19.8,63.8,15.5,56.6,35.5,-,"9,252",...,18.9,67.2,31.3,-,"9,252",19.2,18%,48 : 52,2016,-4.2

In [57]:
merged[merged['university_name'] == 'Aalborg University']['difference']

1    7.3
Name: difference, dtype: object

## 3. Find the university with the largest increase computed in the previous point

In [60]:
merged[merged['difference'] == 'data not available']

,world_rank_min,university_name,country,teaching_min,international_min,research_min,citations_min,income_min,total_score_min,num_students_min,...,research_max,citations_max,income_max,total_score_max,num_students_max,student_staff_ratio_max,international_students_max,female_male_ratio_max,year_max,difference
0,601-800,AGH University of Science and Technology,Poland,14.2,17.9,3.7,35.7,-,-,"35,569",...,3.7,35.7,-,-,"35,569",17.0,1%,-,2016,data not available
12,501-600,American University of Beirut,Lebanon,27.7,93.0,11.2,31.9,-,-,"7,695",...,11.2,31.9,-,-,"7,695",8.9,25%,51 : 49,2016,data not available
19,161,Arizona State University,United States of America,43.0,24.1,44.1,66.9,-,50.3,"83,236",...,38.1,84.6,32.0,49.7,"83,236",29.9,9%,50 : 50,2016,data not available
25,43,Australian National University,Australia,51.9,93.9,62.4,81.0,-,67.0,"14,604",...,77.3,72.3,48.0,69.5,"14,604",19.2,35%,52 : 48,2016,data not available
36,173,Bielefeld University,Germany,39.9,-,35.7,70.4,-,49.3,"21,428",...,46.2,49.9,60.9,-,"21,428",67.8,8%,57 : 43,2016,data not available
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
795,75,William & Mary,United States of America,53.1,20.9,36.1,95.6,-,60.4,"7,867",...,17.5,85.0,29.1,-,"7,867",11.8,7%,54 : 46,2016,data not available
798,401-500,Xiamen University,China,26.7,25.0,15.6,47.0,-,-,"32,921",...,15.6,47.0,-,-,"32,921",12.3,5%,52 : 48,2016,data not available
801,10,Yale University,United States of America,92.1,59.2,89.7,91.5,-,89.5,"11,751",...,87.8,97.2,43.3,87.4,"11,751",4.4,20%,50 : 50,2016,data not available
802,68,Yeshiva University,United States of America,63.5,53.3,46.7,74.4,-,61.4,"6,753",...,23.7,92.8,-,51.2,"6,753",5.5,7%,53 : 47,2016,data not available
813,39,Ã‰cole Polytechnique,France,57.9,77.9,56.1,91.4,-,69.5,"2,429",...,44.6,64.7,82.3,57.9,"2,429",4.8,30%,18 : 82,2016,data not available

In [66]:
merged[merged['difference'] != 'data not available']['difference'].max()

67.80000000000001

In [70]:
merged[merged['difference'] != 'data not available'].sort_values('difference', ascending = False)

,world_rank_min,university_name,country,teaching_min,international_min,research_min,citations_min,income_min,total_score_min,num_students_min,...,research_max,citations_max,income_max,total_score_max,num_students_max,student_staff_ratio_max,international_students_max,female_male_ratio_max,year_max,difference
427,251-275,TU Dresden,Germany,27.3,49.2,13.8,57.4,31.9,-,"35,487",...,45.8,66.1,99.7,52.1,"35,487",37.4,12%,42 : 58,2016,67.8
277,174,Nanyang Technological University,Singapore,43.6,96.3,51.7,45.0,40.0,49.0,"25,028",...,61.3,85.6,99.9,68.2,"25,028",16.2,33%,48 : 52,2016,59.9
229,61,LMU Munich,Germany,59.1,43.1,57.5,76.4,40.4,63.0,"35,691",...,77.4,85.7,100.0,77.3,"35,691",15.5,13%,62 : 38,2016,59.6
204,187,Karlsruhe Institute of Technology,Germany,45.0,47.3,35.4,60.7,40.0,47.2,"25,294",...,47.5,73.8,99.5,54.5,"25,294",24.6,16%,26 : 74,2016,59.5
275,201-225,Nagoya University,Japan,45.5,21.2,39.2,43.8,33.1,-,"15,529",...,38.9,40.1,91.4,-,"15,529",7.9,10%,29 : 71,2016,58.3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
434,122,Technical University of Denmark,Denmark,46.2,64.0,46.9,64.6,95.5,54.5,"9,990",...,29.9,77.8,50.0,51.1,"9,990",5.0,18%,27 : 73,2016,-45.5
585,276-300,University of Iceland,Iceland,10.7,56.9,17.3,62.4,75.4,-,"13,960",...,16.2,91.4,28.0,-,"13,960",25.9,8%,66 : 34,2016,-47.4
236,124,Leiden University,Netherlands,47.3,40.0,54.9,59.3,100.0,54.4,"21,222",...,63.1,85.2,49.8,65.7,"21,222",17.1,10%,59 : 41,2016,-50.2
490,95,University of Arizona,United States of America,52.4,21.9,52.2,70.1,84.2,57.3,"36,429",...,41.8,79.5,32.4,51.7,"36,429",12.7,8%,52 : 48,2016,-51.8
413,226-250,State University of New York Albany,United States of America,25.7,25.9,30.8,53.5,92.9,-,"15,387",...,35.3,35.5,28.0,-,"15,387",18.5,8%,51 : 49,2016,-64.9

In [86]:
#da rivedere

temp = -1000

for i in range(1, len(merged)-1):
    
    if merged.iloc[i]['difference'] != 'data not available':
        if merged.iloc[i]['difference'] > temp:
                temp = merged.iloc[i]['difference']
                index = i
        
merged.iloc[index]

world_rank_min                   251-275
university_name               TU Dresden
country                          Germany
teaching_min                        27.3
international_min                   49.2
research_min                        13.8
citations_min                       57.4
income_min                          31.9
total_score_min                        -
num_students_min                  35,487
student_staff_ratio_min             37.4
international_students_min           12%
female_male_ratio_min            42 : 58
year_min                            2012
world_rank_max                      =158
teaching_max                        41.4
international_max                   47.7
research_max                        45.8
citations_max                       66.1
income_max                          99.7
total_score_max                     52.1
num_students_max                  35,487
student_staff_ratio_max             37.4
international_students_max           12%
female_male_ratio_max            42 : 58
year_max                            2016
difference                          67.8
Name: 427, dtype: object

In [ ]:
merged['income_max'] = pd.to_numeric(merged['income_max'], errors = 'coerce')
merged['income_min'] = pd.to_numeric(merged['income_min'], errors = 'coerce')

In [ ]:
merged['difference'] = merged['income_max'] - merged['income_min']

In [ ]:
merged.iloc[merged['difference'].idxmax()]['university_name']

## 4. For each ranking, consider only the most recent data point. For each university, compute the maximum difference between the rankings (e.g. for Aarhus University the value is 122-73=49). Notice that some rankings are expressed as a range

## 5. Consider only the most recent data point of the times dataset. Compute the number of male and female students for each country.

## 6. Find the universities where the ratio between female and male is below the average ratio (computed over all universities)

## 7. For each country, compute the fraction of the students in the country that are in one of the universities computed in the previous point (that is, the denominator of the ratio is the total number of students over all universities in the country).

## 8. Read the file educational_attainment_supplementary_data.csv, discarding any row with missing country_name or series_name

## 9. From attainment build a dataframe with the same data, but with 4 columns: country_name, series_name, year, value

## 10. For each university, find the number of rankings in which they appear (it suffices to appear in one year for each ranking).

## 11. In the times ranking, compute the number of times each university appears

## 12. Find the universities that appear at most twice in the times ranking.

## 13. The universities that, in any year, have the same position in all three rankings (they must have the same position in a year).